<?php

return [
    /*
    |--------------------------------------------------------------------------
    | 默认加载的目录
    |--------------------------------------------------------------------------
    |
    | 你可以配置成任意目录，前提下是可以保证具有访问权限。
    |
    */
    'base'      => storage_path(),

    /*
    |--------------------------------------------------------------------------
    | 静态文件 url 前缀
    |--------------------------------------------------------------------------
    |
    | 默认不填表示当前 url
    | 如果需要将静态资源上传到 cdn 或者 oss，则需要填写该参数，如 https://static.knowthat.cn
    |
    */
    'static_url'    =>  '',

    /*
    |--------------------------------------------------------------------------
    | 默认 cdn
    |--------------------------------------------------------------------------
    */
    'default_cdn'   => [
        'css'   => [
            // element css
            'https://unpkg.com/element-ui/lib/theme-chalk/index.css'
        ],
        'js'    => [
            // vue2
            'https://cdn.jsdelivr.net/npm/vue@2.x/dist/vue.js',

            // axios
            'https://cdn.jsdelivr.net/npm/axios/dist/axios.min.js',

            // element
            'https://unpkg.com/element-ui/lib/index.js'
        ]
    ]
];
